
#자료형은 문자의 값을 숫자로 인식 할지 구분할수 있게 해주는 타입

#(자료에 대한 타입)
#숫자형,문자열,불(참,거짓을 나타내는 자료형)

#변수,리스트,튜플,딕셔너리,집합
#(어떤 값을 담는 자료구조)

#변수:어떤 값을 담는 상자라고 이해하면된다.

#[숫자형]

#정수형(int),실수(float),컴퓨터식 지수 표현 방식,8진수,16진수
# 나누기:/,몫://,나머지:%,제곱:**

#문자열 자료형 만드는 4가지 방법

#문자열(str)[string]
#syntax error:프로그래밍의 구문 오류
# "",'',"""""",''''''
#\':문자 따옴표 설정
#\n:줄바꿈

#인덱싱(indexing):소스코드에 문자마다 번호가 새겨져 있다.
#a = "python is very cool"
#print(a[0])
#슬라이싱(slicing):단어를 뽑아내는 기법
#print(a[이상:미만:간격])
a = "123456789"
print(a[::-2])